app/Controllers/Admin/Dashboard.php

SELECT `submit_pjum`
FROM `transaksi`
WHERE `id_transaksi` = '7'
 LIMIT 1
SELECT `submit_pb`
FROM `transaksi`
WHERE `id_transaksi` = '7'
 LIMIT 1
SELECT `kota`
FROM `transaksi`
WHERE `id_transaksi` = '7'
 LIMIT 1
SELECT `login_by`
FROM `transaksi`
WHERE `id_transaksi` = '7'
 LIMIT 1
---
    public function dashboard($id_transaksi)
    {
        $nik= session()->get('akun_nik');
        $niknm= session()->get('niknm');
        $role= session()->get('akun_role');
        $strorg = session()->get('strorg');
        $submit_pjum = $this->m_id->where('id_transaksi', $id_transaksi)->select('submit_pjum, kirim_pjum')->first();
        $submit_pb = $this->m_id->where('id_transaksi', $id_transaksi)->select('submit_pb, kirim_pb')->first();
        $kota = $this->m_id->where('id_transaksi', $id_transaksi)->select('kota')->first();

        $login = $this->m_id->where('id_transaksi', $id_transaksi)->select('login_by')->first();