app/Controllers/Admin/PJUM.php

SELECT `login_by`
FROM `transaksi`
WHERE `id_transaksi` = '5'
 LIMIT 1
SELECT `id_kategori`
FROM `kategori`
WHERE `id_transaksi` = '5'
AND `jenis_biaya` = 'pjum'
 LIMIT 1
---
    public function listpjum($jenis_biaya, $id_transaksi)
    {
        $nik = session()->get('akun_nik');
        $niknm = session()->get('niknm');
        $role = session()->get('akun_role');
        $strorg = session()->get('strorg');

        $login = $this->m_id->where('id_transaksi', $id_transaksi)->select('login_by')->first();

        if ($role == 'admin' && $login['login_by'] != $niknm || $role == 'user' && $login['login_by'] != $niknm) {
            session()->setFlashdata('warning', ['Id transaksi sedang diedit, harap menunggu beberapa saat lagi']);
            return redirect()->to("transaksi");
        } else {

        }

        if($role == 'admin') {
            $dataPost = $this->m_id->getPostId($id_transaksi, substr($strorg, 0, 4));
        } elseif($role == 'user') {
            $dataPost = $this->m_id->getId($id_transaksi, $nik);
        } elseif($role == 'treasury') {
            $dataPost = $this->m_id->getTreasuryDashboard($id_transaksi);
        } elseif($role == 'gs') {
            $dataPost = $this->m_id->getGSDashboard($id_transaksi);
        }
        if(empty($dataPost)) {
            return redirect()-> to("transaksi");
        }
        $data = $dataPost;

        $kat = $this->m_kategori->where('id_transaksi', $id_transaksi)->where('jenis_biaya', $jenis_biaya)->select('id_kategori')->first();

SELECT `submit_pjum`, `kirim_pjum`
FROM `transaksi`
WHERE `id_transaksi` = '5'
 LIMIT 1
SELECT `submit_pb`
FROM `transaksi`
WHERE `id_transaksi` = '5'
 LIMIT 1
---
            return redirect()-> to('listpjum/pjum/'.$id_transaksi);
        }

        $submit_pjum = $this->m_id->where('id_transaksi', $id_transaksi)->select('submit_pjum, kirim_pjum')->first();
        $submit_pb = $this->m_id->where('id_transaksi', $id_transaksi)->select('submit_pb')->first();

SELECT `nik`, `strorgnm`
FROM `transaksi`
WHERE `id_transaksi` = '5'
 LIMIT 1
SELECT `niknm`
FROM `am21`
WHERE `nik` = '08008'
 LIMIT 1
SELECT `noemailint`
FROM `am21b`
WHERE `nik` = '08008'
 LIMIT 1
---
        $timestamp = date('Y-m-d H:i:s');

        $mail = new PHPMailer(true);
        $nikuser = $this->m_id->where('id_transaksi', $id_transaksi)->select('nik, strorgnm')->first();
        $niknmuser = $this->m_am21->where('nik', $nikuser['nik'])->select('niknm')->first();
        $emailuser = $this->m_am21b->where('nik', $nikuser['nik'])->select('noemailint')->first();

SELECT `kota`
FROM `transaksi`
WHERE `id_transaksi` = '5'
 LIMIT 1
---
            return redirect()->to('listpjum/'.$jenis_biaya.'/'.$id_transaksi);
        }

        $kota = $this->m_id->where('id_transaksi', $id_transaksi)->select('kota')->first();