app/Models/BiayaModel.php

    public function alldatapjum($id_transaksi, $jenis_biaya, $id_pjum){
        $builder = $this->table($this->table);

        $builder->Where('id_transaksi', $id_transaksi);
        $builder->Where('jenis_biaya', $jenis_biaya);
        $builder->Where('id_pjum', $id_pjum);

        $builder->orderBy('baris', 'asc');
        $query = $builder->get();
---
SELECT *
FROM `biaya`
WHERE `id_transaksi` = '6'
AND `jenis_biaya` = 'pjum'
AND `id_pjum` = '44'
ORDER BY `baris` ASC

    public function tukarUangMasuk($id_transaksi, $jenis_biaya, $id_pjum){
        $builder = $this->table($this->table);
        $builder->select('sum(biaya) as uangmasuk, simbol, id_valas');
        $builder->where('id_transaksi', $id_transaksi);
        $builder->where('jenis_biaya', $jenis_biaya);
        $builder->where('id_pjum', $id_pjum);
        $kategori = ['Tukar Uang Masuk'];
        $builder->whereIn('kategori', $kategori);
        $builder->groupBy(['id_valas', 'id_transaksi', 'jenis_biaya']);
        $builder->orderBy('id_biaya', 'asc');
        $query = $builder->get();
---
SELECT sum(biaya) as pengeluaran, `simbol`, `id_valas`
FROM `biaya`
WHERE `id_transaksi` = '6'
AND `jenis_biaya` = 'pjum'
AND `id_pjum` = '44'
AND `kategori` NOT IN ('Tukar Uang Masuk','Tukar Uang Keluar','Kembalian')
GROUP BY `id_valas`, `id_transaksi`, `jenis_biaya`
ORDER BY `id_biaya` ASC

    public function tukarUangKeluar($id_transaksi, $jenis_biaya, $id_pjum){
        $builder = $this->table($this->table);
        $builder->select('sum(biaya) as uangkeluar, simbol, id_valas');
        $builder->where('id_transaksi', $id_transaksi);
        $builder->where('jenis_biaya', $jenis_biaya);
        $builder->where('id_pjum', $id_pjum);
        $kategori = ['Tukar Uang Keluar'];
        $builder->whereIn('kategori', $kategori);
        $builder->groupBy(['id_valas', 'id_transaksi', 'jenis_biaya']);
        $builder->orderBy('id_biaya', 'asc');
        $query = $builder->get();
---
SELECT sum(biaya) as pengeluaran, `simbol`, `id_valas`
FROM `biaya`
WHERE `id_transaksi` = '5'
AND `jenis_biaya` = 'pjum'
AND `id_pjum` = '9'
AND `kategori` NOT IN ('Tukar Uang Masuk','Tukar Uang Keluar','Kembalian')
GROUP BY `id_valas`, `id_transaksi`, `jenis_biaya`
ORDER BY `id_biaya` ASC

    public function uangMasuk($id_transaksi, $jenis_biaya, $id_pjum){
        $builder = $this->table($this->table);
        $builder->select('sum(biaya) as uangmasuk, simbol, id_valas');
        $builder->where('id_transaksi', $id_transaksi);
        $builder->where('jenis_biaya', $jenis_biaya);
        $builder->where('id_pjum', $id_pjum);
        $kategori = ['Tukar Uang Masuk', 'Kembalian'];
        $builder->whereIn('kategori', $kategori);
        $builder->groupBy(['id_valas', 'id_transaksi', 'jenis_biaya']);
        $builder->orderBy('id_biaya', 'asc');
        $query = $builder->get();
---
SELECT 0 as `uangmasuk`, `id_valas`
FROM `biaya`
WHERE `id_transaksi` = '6'
AND `jenis_biaya` = 'pjum'
AND `id_pjum` = '44'
GROUP BY `id_valas`, `id_transaksi`, `jenis_biaya`
ORDER BY `id_biaya` ASC

    public function totalsupport($id_transaksi){
        $builder = $this->table($this->table);
        $builder->select('sum(biaya) as totalBiaya, simbol, id_valas');
        $builder->where('id_transaksi', $id_transaksi);
        $jenis_biaya = ['Support'];
        $builder->whereIn('jenis_biaya', $jenis_biaya);
        $builder->groupBy(['id_valas', 'id_transaksi', 'jenis_biaya']);
        $builder->orderBy('id_biaya', 'asc');
        $query = $builder->get();
---
SELECT *
FROM `biaya`
WHERE `id_transaksi` = '6'
GROUP BY `id_biaya`