app/Models/Bm06Model.php

SELECT *
FROM `bm06`
WHERE `strorg` = '1120100000'
---
    public function getData($parameter)
    {
        $builder = $this->table /*builder*/ ($this->table /*Model*/);

        $builder->select('strorgnm, tglsls');
        $builder->where('strorg=', $parameter);
        $query = $builder->get();

SELECT *
FROM `bm06`
WHERE SUBSTRING(strorg, 1, 4) = '1120'
ORDER BY `strorg` ASC
---
    public function bagian($strorg)
    {
        $builder = $this->table($this->table);

        $builder->select('strorgnm');

        $builder->Where('SUBSTRING(strorg, 1, 4)', $strorg);
        $builder->orderBy('strorg', 'asc');

        $query = $builder->get();