app/Models/KategoriModel.php

SELECT `id_kategori`
FROM `kategori`
WHERE `id_transaksi` = '5'
AND `jenis_biaya` = 'PJUM'
ORDER BY `id_kategori` ASC
---
    public function alldataId($id_transaksi, $jenis_biaya)
    {
        $builder = $this->table($this->table);

        $builder->select('id_kategori');

        $builder->Where('id_transaksi', $id_transaksi);
        $builder->Where('jenis_biaya', $jenis_biaya);

        $builder->orderBy('id_kategori', 'asc');
        $query = $builder->get();

SELECT *
FROM `kategori`
WHERE `id_transaksi` = '5'
AND `jenis_biaya` = 'pjum'
AND `id_pjum` = '9'
ORDER BY `baris` ASC
---
    public function alldataNomorpjum($id_transaksi, $jenis_biaya, $id_pjum){
        $builder = $this->table($this->table);

        $builder->Where('id_transaksi', $id_transaksi);
        $builder->Where('jenis_biaya', $jenis_biaya);
        $builder->Where('id_pjum', $id_pjum);

        $builder->orderBy('baris', 'asc');
        $query = $builder->get();

SELECT `id_transaksi`
FROM `kategori`
WHERE `id_transaksi` = '5'
---
    public function cek($id_transaksi){
        $builder = $this->table($this->table);

        $builder->Select('id_transaksi', $id_transaksi);
        $builder->Where('id_transaksi', $id_transaksi);

        $query = $builder->get();