app/Models/KursModel.php

    public function getkurspjum($id_pjum)
    {
        $builder = $this->table /*builder*/ ($this->table /*Model*/);

        $builder->select('id_pjum, id_kurs, kurs, tanggal');

        $builder->where('id_pjum', $id_pjum);
        $query = $builder->get();
---
SELECT `id_pjum`, `id_kurs`, `kurs`
FROM `kurs`
WHERE `id_pjum` = '9'