app/Models/NegaraModel.php

SELECT *
FROM `negara`
---
    public function getDataAll()
    {
        $builder = $this->table /*builder*/ ($this->table /*Model*/);

        $builder->select('negara_tujuan');

        $query = $builder->get();