app/Models/NegaraTujuanModel.php

    public function getDataAllId($id_transaksi)
    {
        $builder = $this->table($this->table);
        $builder->select('negara_tujuan');

        $builder->where('id_transaksi', $id_transaksi);

        $query = $builder->get();
---
SELECT `negara_tujuan`
FROM `negaratujuan`
WHERE `id_transaksi` = '5'