app/Models/PersonilModel.php

SELECT *
FROM `personil`
WHERE `id_transaksi` = '7'
---
    public function getDataAllId($id_transaksi)
    {
        $builder = $this->table($this->table);
        $builder -> select('niknm, nik, strorgnm');
        $builder -> where('id_transaksi', $id_transaksi);
        $query = $builder->get();