app/Models/PjumModel.php

SELECT `id_pjum`, `nomor`, `tanggal`
FROM `pjum`
WHERE `id_transaksi` = '5'
GROUP BY `id_pjum`
ORDER BY `id_pjum` ASC
---
    public function nomor($id_transaksi){
        $builder = $this->table($this->table);

        $builder->select('id_pjum, nomor, tanggal');

        $builder->Where('id_transaksi', $id_transaksi);

        $builder->orderBy('id_pjum', 'asc');
        $builder->groupBy(['id_pjum']);
        $query = $builder->get();

SELECT *
FROM `pjum`
WHERE `id_transaksi` = '5'
AND `id_pjum` = '9'
ORDER BY `id_pjum` ASC
---
    public function getData($id_transaksi, $id_pjum){
        $builder = $this->table($this->table);

        $builder->Where('id_transaksi', $id_transaksi);
        $builder->Where('id_pjum', $id_pjum);

        $builder->orderBy('id_pjum', 'asc');
        $query = $builder->get();

SELECT *
FROM `pjum`
WHERE `id_transaksi` = '5'
AND `kolom` IS NULL
ORDER BY `id_pjum` ASC
---
    public function ceknomor($id_transaksi, $kolom)
    {
        $builder = $this->table($this->table);

        $builder -> where('id_transaksi', $id_transaksi);
        $builder -> where('kolom', $kolom);

        $builder->orderBy('id_pjum', 'asc');
        $query = $builder->get();