app/Models/PumModel.php

    public function valas($id_transaksi){
        $builder = $this->table($this->table);

        $builder->select('id_pjum, id_valas, kode_valas');

        $builder->Where('id_transaksi', $id_transaksi);

        $builder->groupBy(['id_pjum']);
        $builder->orderBy('id_pjum', 'asc');
        $query = $builder->get();
---
SELECT `id_pjum`, `id_valas`, `kode_valas`
FROM `pum`
WHERE `id_transaksi` = '5'
GROUP BY `id_pjum`
ORDER BY `id_pjum` ASC

    public function sisa($id_transaksi, $id_pjum){
        $builder = $this->table($this->table);
        $builder->select('pum, uang_kembali, simbol, id_valas, id_pum, id_pjum');
        $builder->where('id_transaksi', $id_transaksi);
        $builder->where('id_pjum', $id_pjum);
        $builder->groupBy(['id_valas', 'id_transaksi']);
        $builder->orderBy('id_pum', 'asc');
        $query = $builder->get();
---
SELECT `pum`, `uang_kembali`, `simbol`, `id_valas`, `id_pum`, `id_pjum`
FROM `pum`
WHERE `id_transaksi` = '5'
AND `id_pjum` = '9'
GROUP BY `id_valas`, `id_transaksi`
ORDER BY `id_pum` ASC