app/Models/TransaksiModel.php

    public function kota($id_transaksi){
        $builder = $this->table($this->table);

        $builder->select('kota');

        $builder->Where('id_transaksi', $id_transaksi);

        $builder->orderBy('kota', 'asc');
        $builder->groupBy('kota');
        $query = $builder->get();
---
SELECT `kota`
FROM `transaksi`
WHERE `id_transaksi` = '5'
GROUP BY `kota`
ORDER BY `kota` ASC

    public function getTreasury($id_transaksi){
        $builder = $this->table($this->table);

        $builder->where('id_transaksi', $id_transaksi);
        $builder->orderBy('id_transaksi', 'asc');

        $query = $builder->get();
---
SELECT *
FROM `transaksi`
WHERE `id_transaksi` = '6'
AND SUBSTRING(strorg, 1, 4) = '1120'