app/Models/ValasModel.php

    public function getDataAll()
    {
        $builder = $this->table /*builder*/ ($this->table /*Model*/);
        $query = $builder->get();
---
SELECT *
FROM `valas`